



Audio Video Transport                                           A. Leung
Internet-Draft                                                S. Futemma
Expires: July 29, 2006                                        E. Itakura
                                                                    Sony
                                                        January 25, 2006


Payload Format for JPEG 2000 Video: Extensions for Scalability and Main
                            Header Recovery
                    draft-ietf-avt-rtp-jpeg2000-beam-02

Status of this Memo

   By submitting this Internet-Draft, each author represents that any
   applicable patent or other IPR claims of which he or she is aware
   have been or will be disclosed, and any of which he or she becomes
   aware will be disclosed, in accordance with Section 6 of BCP 79.
   This document may not be modified, and derivative works of it may not
   be created.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups.  Note that
   other groups may also distribute working documents as Internet-
   Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at
   http://www.ietf.org/ietf/1id-abstracts.txt.

   The list of Internet-Draft Shadow Directories can be accessed at
   http://www.ietf.org/shadow.html.

   This Internet-Draft will expire on July 29, 2006.

Copyright Notice

   Copyright (C) The Internet Society (2006).

Abstract

   This memo describes extended uses for payload header in RFC document:
   "An RTP Payload Format for JPEG 2000 Video Streams." [1] For better
   support of JPEG 2000 features such as scalability and includes a main
   header recovery method.



Leung, et al.             Expires July 29, 2006                 [Page 1]

Internet-Draft              JPEG 2000 RTP EX                January 2006


   This memo MUST be accompanied with a complete implementation of "An
   RTP Payload Format for JPEG 2000 Video Streams." [1] The RFC document
   [1] itself is a complete description of the payload header and
   signaling, this document only describes additional processing for the
   payload header.  There is an additional MIME and SDP marker signaling
   for implementations of this document.


Table of Contents

   1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  3
     1.1.  History  . . . . . . . . . . . . . . . . . . . . . . . . .  3
     1.2.  Description of the Mechanisms  . . . . . . . . . . . . . .  3
       1.2.1.  Main Header Compensation . . . . . . . . . . . . . . .  3
       1.2.2.  Priority Table . . . . . . . . . . . . . . . . . . . .  3
     1.3.  Conventions Used in This Document  . . . . . . . . . . . .  4
   2.  Payload Format Enhanced Processing . . . . . . . . . . . . . .  5
     2.1.  Enhanced Processing Markers  . . . . . . . . . . . . . . .  5
   3.  Priority Mapping Table . . . . . . . . . . . . . . . . . . . .  7
     3.1.  Pre-Defined Priority Mapping . . . . . . . . . . . . . . .  7
       3.1.1.  Packet Number Based Ordering . . . . . . . . . . . . .  7
       3.1.2.  Progression Based Ordering . . . . . . . . . . . . . .  7
       3.1.3.  Layer Based Ordering . . . . . . . . . . . . . . . . .  8
       3.1.4.  Resolution Based Ordering  . . . . . . . . . . . . . .  9
       3.1.5.  Component Based Ordering . . . . . . . . . . . . . . .  9
   4.  JPEG 2000 Main Header Compensation Scheme  . . . . . . . . . . 10
     4.1.  Sender Processing  . . . . . . . . . . . . . . . . . . . . 10
     4.2.  Receiver Processing  . . . . . . . . . . . . . . . . . . . 10
   5.  Security Consideration . . . . . . . . . . . . . . . . . . . . 12
   6.  IANA Consideration . . . . . . . . . . . . . . . . . . . . . . 13
     6.1.  Media Type Registration  . . . . . . . . . . . . . . . . . 13
     6.2.  SDP Parameters . . . . . . . . . . . . . . . . . . . . . . 14
   7.  Usage with the SDP Offer/Answer Model  . . . . . . . . . . . . 16
     7.1.  Examples . . . . . . . . . . . . . . . . . . . . . . . . . 16
       7.1.1.  Example 1  . . . . . . . . . . . . . . . . . . . . . . 16
       7.1.2.  Example 2  . . . . . . . . . . . . . . . . . . . . . . 17
   8.  References . . . . . . . . . . . . . . . . . . . . . . . . . . 18
     8.1.  Normative References . . . . . . . . . . . . . . . . . . . 18
     8.2.  Informative References . . . . . . . . . . . . . . . . . . 18
   Appendix A.  Sample Headers in Detail  . . . . . . . . . . . . . . 19
   Authors' Addresses . . . . . . . . . . . . . . . . . . . . . . . . 27
   Intellectual Property and Copyright Statements . . . . . . . . . . 28









Leung, et al.             Expires July 29, 2006                 [Page 2]

Internet-Draft              JPEG 2000 RTP EX                January 2006


1.  Introduction

   This document is an extension of: "An RTP Payload Format for JPEG
   2000 Video Streams"[1].  There are additional mechanisms to be used
   with certain parts of the header in [1] to support JPEG 2000 features
   such as scalability and a main header compensation method.  These
   mechanisms are described in detail in this document.

1.1.  History

   In the development of [1], Sony Corporation filed a patent
   application on certain mechanisms with the main header compensation,
   priority table usage, etc. in [1].  As these are not "essential" to
   the core RTP format of [1] and only describes a mechanism, it was
   decided that splitting these mechanisms from the core RTP format in
   to a separate document.  This is the document describing the IPR
   related mechanisms for main header recover and priority table usage.

1.2.  Description of the Mechanisms

1.2.1.  Main Header Compensation

   JPEG 2000's scalable coding scheme allows for decompressing truncated
   or partial data streams but only when the main header is present.  If
   the header is lost, the data is useless.  With JPEG 2000 video
   coding, coding parameters between frames will rarely change and
   previous headers may be used in newly received data which the header
   have been lost.

   Compensation of the main header that has been lost is very simple
   with this procedure.  In the case of JPEG 2000 video, it is common
   that encode parameters will not vary greatly between each successive
   frame.  Even if the RTP packet including the main header of a frame
   has been dropped, decoding may be performed by using the main header
   of a previous frame.

1.2.2.  Priority Table

   JPEG 2000 codestream has rich functionality built into it so decoders
   can easily handle scalable delivery or progressive transmission.
   Progressive transmission allows images to be reconstructed with
   increasing pixel accuracy or spatial resolution.  This feature allows
   the reconstruction of images with different resolutions and pixel
   accuracy, for different target devices.  A single image source can
   provide a codestream that is easily processed for smaller image
   display devices.

   JPEG 2000 packets contain all compressed image data from a specific:



Leung, et al.             Expires July 29, 2006                 [Page 3]

Internet-Draft              JPEG 2000 RTP EX                January 2006


   layer, component, resolution level, and/or precinct.  The order in
   which these JPEG 2000 packets are found in the codestream is called:
   progression order.  The ordering of the JPEG 2000 packets can
   progress along four axes: layer, component, resolution and precinct
   (or position).

   Providing a priority field to indicate the importance of data
   contained in a given RTP packet can aid in usage of JPEG 2000
   progressive and scalable functions.

1.3.  Conventions Used in This Document

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in RFC2119 [2].




































Leung, et al.             Expires July 29, 2006                 [Page 4]

Internet-Draft              JPEG 2000 RTP EX                January 2006


2.  Payload Format Enhanced Processing

2.1.  Enhanced Processing Markers

   This section of the document describes changes in the value of mh_id
   and priority value and interpretation which differ from [1].
   Implementions of this document should follow protocol in [1] first
   then add in additional header processing as described in this
   document.  Implementations following this document are expected to
   interoperate with implementations of [1] and this document as well.

   The RTP payload header format for JPEG 2000 video stream is as
   follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |tp |MHF|mh_id|T|     priority  |           tile number         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |reserved       |             fragment offset                   |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+



   Figure 1: RTP payload header format for JPEG 2000

   mh_id (Main Header Identification) : 3 bits

      Main header identification value.  This is used for JPEG 2000 main
      header recovery.

      The same mh_id value is used as long as the coding parameters
      described in the main header remains unchanged between frames.

      The initial value of mh_id is random, and may take any value
      between 1-7, but MUST NOT be 0.

      The mh_id value MUST increment by 1 every time a new main header
      is transmitted.  Once the mh_id value is greater than 7, it rolls
      over to 1.

      When mh_id is 0, it has special usage for the receiver.  This
      special usage is described in Section 4.2 of this document.

      Senders should follow Section 4.1 of this document for proper
      mh_id usage.

   priority : 8 bits



Leung, et al.             Expires July 29, 2006                 [Page 5]

Internet-Draft              JPEG 2000 RTP EX                January 2006


      The priority field indicates the importance of the JPEG 2000
      packet included in the payload.  Typically, a higher priority is
      set in the packets containing JPEG 2000 packets containing the
      lower sub-bands.

      Special values of priority:

      0: This is reserved for payload which contain a header (main or
         tile part header.)  This is considered the most important.

      1 to 255: These values decrease in importance as the values
         increase. (i.e. 1 is more important than 2, etc.)  Hence
         applying priority values should correlate directly to JPEG 2000
         codestream in importance.

      The lower the priority value is the higher the priority.  Simply,
      the priority value 0 is the highest priority and 255 is the lowest
      priority.  We define the priority value 0 as a special priority
      value for the headers (the main header or tile-part header).  When
      any headers (the main header or tile-part header) are packed into
      the RTP packet, the sender MUST set the priority value to 0.

      Assignment of the values are described in Section 3 with pre-
      defined table assignments in Section 3.1.



























Leung, et al.             Expires July 29, 2006                 [Page 6]

Internet-Draft              JPEG 2000 RTP EX                January 2006


3.  Priority Mapping Table

   For the progression order, the priority value for each JPEG 2000
   packet is given by the priority mapping table.

3.1.  Pre-Defined Priority Mapping

   This document specify several commonly-used priority mapping tables,
   pre-defined priority mapping tables: packet number based (default),
   progression-based, layer-based, resolution-based, position-based, and
   component-based.

   Packet number priority mapping is REQUIRED to be supported by clients
   implementing this specification.  Other priority mapping tables
   (progression, layer, resolution, and component based) are OPTIONAL to
   implementations of this specification.

   Rules that all implementations of this specification MUST follow in
   all priority modes:

   o  When there is a header in the packet with a JPEG 2000 packet, the
      sender MUST set the payload packet priority value to 0.

   o  When there are multiple JPEG 2000 packets in the same RTP payload
      packet, the sender MUST set the payload packet priority value to
      the lowest priority value of the lowest JPEG 2000 packet. (i.e. if
      JPEG 2000 packets with priority: 5,6,7 are packed into a single
      payload, the priority value MUST be 5.)

3.1.1.  Packet Number Based Ordering

   This is the default mode for payload packet priority value and all
   implementation of this specification MUST support.

   The sender will have a one-to-one association between payload packet
   priority value and the payload packet value (i.e. the JPEG 2000
   codestream.)  The RTP packet value is equal to the JPEG 2000 packet
   value.

   If the packet value of JPEG 2000 codestream is greater than 255, the
   sender MUST set the payload priority value to 255.

3.1.2.  Progression Based Ordering

   The sender will assign the payload packet priority value only based
   on layer, resolution, and component ordering of the codestream.

   This is similar to the JPEG 2000 packet number based format but will



Leung, et al.             Expires July 29, 2006                 [Page 7]

Internet-Draft              JPEG 2000 RTP EX                January 2006


   not take into account the precinct number or position in the JPEG
   2000 codestream.

   For example:

   If the codestream is ordered in LRCP (Layer, Resolution, Component,
   Position)

      All the packets in:

         layer.........0
         resolution....0
         component.....0

      then the packet priority value : 1

      All the packets in:

         layer.........0
         resolution....0
         component.....1

      then the packet priority value : 2

      All the packets in:

         layer.........0
         resolution....0
         component.....2

      then the packet priority value : 3

3.1.3.  Layer Based Ordering

   Layer-based priority mapping table simplifies the default mapping to
   just matching JPEG 2000 packets together from the same layer.

   For example:

      All the packets in layer 0 : packet priority value : 1
      All the packets in layer 1 : packet priority value : 2
      All the packets in layer 2 : packet priority value : 3
      ...
      All the packets in layer n : packet priority value : n+1







Leung, et al.             Expires July 29, 2006                 [Page 8]

Internet-Draft              JPEG 2000 RTP EX                January 2006


3.1.4.  Resolution Based Ordering

   Resolution-based priority mapping table is similar to the layer based
   order but for JPEG 2000 packets of the same resolution

   For example:

      All the packets in resolution 0 : packet priority value : 1
      All the packets in resolution 1 : packet priority value : 2
      All the packets in resolution 2 : packet priority value : 3
      ...
      All the packets in resolution n : packet priority value : n+1

3.1.5.  Component Based Ordering

   Component-based priority mapping table is mapping together JPEG 2000
   components of the same component

   For example:

      All the packets in component 0 : packet priority value : 1
      All the packets in component 1 : packet priority value : 2
      All the packets in component 2 : packet priority value : 3
      ...
      All the packets in component n : packet priority value : n+1


























Leung, et al.             Expires July 29, 2006                 [Page 9]

Internet-Draft              JPEG 2000 RTP EX                January 2006


4.  JPEG 2000 Main Header Compensation Scheme

   The mh_id field of the payload header is used to recognize whether
   the encoding parameters of the main header are the same as the
   encoding parameters of the previous frame.  The same value is set in
   mh_id of the RTP packet in the same frame.  The mh_id and encode
   parameters are not associated with each other as 1:1 but they are
   used to recognize whether the encode parameters of the previous frame
   are the same or not in the event of a lost header.

   The mh_id field value SHOULD be saved from previous frames to be used
   to recover the current frame's main header.  If the mh_id of the
   current frame has the same value as the mh_id value of the previous
   frame, the previous frame's main header MAY be used to decode the
   current frame, in case of a lost header in the current frame.

   The sender MUST increment mh_id when parameters in the header change
   and send a new main header accordingly.

   The receiver MAY use the mh_id and MAY retain the header for such
   compensation.

4.1.  Sender Processing

   The sender MUST transmit RTP packets with the same mh_id value unless
   the encoder parameters are different from the previous frame.  The
   encoding parameters are the fixed information marker segment (SIZ
   marker) and functional marker segments (COD, COC, RGN, QCD, QCC, and
   POC) specified in JPEG 2000 Part 1 Annex A [3].  An initial value of
   mh_id MUST be selected randomly between 1 and 7 for security reasons.

   If the encode parameters changes, the sender transmitting RTP packets
   MUST increment the mh_id value by one, but when mh_id value becomes
   greater than 7, a sender MUST set mh_id value to 1.

4.2.  Receiver Processing

   When the receiver receives the main header completely, the RTP
   sequence number, the mh_id and main header should be saved.  Only the
   last main header that was received completely SHOULD be saved.  When
   the mh_id value is 0, the receiver SHOULD NOT save the header.

   When the main header is not received, the receiver may compare the
   current payload header's mh_id value with the previous saved mh_id
   value.  If the values match, decoding may be performed by using the
   previously saved main header.

   If the mh_id field is set to 0, the receiver MUST not save the main



Leung, et al.             Expires July 29, 2006                [Page 10]

Internet-Draft              JPEG 2000 RTP EX                January 2006


   header and MUST NOT compensate for lost headers.


















































Leung, et al.             Expires July 29, 2006                [Page 11]

Internet-Draft              JPEG 2000 RTP EX                January 2006


5.  Security Consideration

   RTP packets using the payload format defined in this specification
   are subject to the security considerations discussed in the RTP
   specifications[4] and any applicable profile.  This implies that
   confidentiality of the media streams is achieved by encryption.  Data
   compression used with this payload format is applied end-to-end,
   encryption may be performed on the compressed data so there is no
   conflict between the two operations.

   A potential denial-of-service threat exists for data encodings using
   compression techniques that have non-uniform receiver-end
   computational load.  The attacker can inject pathological datagrams
   into the stream which are complex to decode and cause the receiver to
   be overloaded.  The usage of authentication of at least the RTP
   packet is RECOMMENDED, for example with SRTP [3].

   If QoS enhanced service is used, RTP receivers SHOULD monitor packet
   loss to ensure that the service that was requested is actually being
   delivered.  If it is not, then they SHOULD assume that they are
   receiving best-effort service and behave accordingly.

   If best-effort service is being used, users of this payload format
   MUST monitor packet loss to ensure that the packet loss rate is
   within acceptable parameters.  Packet loss is considered acceptable
   if a TCP flow across the same network path, experiencing the same
   network conditions, would achieve an average throughput, measured on
   a reasonable timescale, that is not less than the RTP flow is
   achieving.  This condition can be satisfied by implementing
   congestion control mechanisms to adapt the transmission rate (or the
   number of layers subscribed for a layered multicast session), or by
   arranging for a receiver to leave the session if the loss rate is
   unacceptably high.

   As with any IP-based protocol, in some circumstances a receiver may
   be overloaded simply by receiving too many packets, either desired or
   undesired.  Network-layer authentication may be used to discard
   packets from undesired sources, but the processing cost of the
   authentication itself may be too high.  In a multicast environment,
   pruning of specific sources may be implemented in future versions of
   IGMP [8] and in multicast routing protocols to allow a receiver to
   select which sources are allowed to reach it.









Leung, et al.             Expires July 29, 2006                [Page 12]

Internet-Draft              JPEG 2000 RTP EX                January 2006


6.  IANA Consideration

6.1.  Media Type Registration

   This document extends the associated media type from [1]:

      video/jpeg2000

   The receiver MUST ignore any unspecified parameters outside of this
   list and in [1] .

   Optional parameters:

   mhc : this option is used when sender and/or receiver is utilizing
      the Main Header compensation technique as specified in this
      document.

      This is a list of options to be included when the sender or
      receiver is utilizing the Priority Table(s) as specified in this
      document.

   priority-table-default : this is for the default priority table
      mapping scheme.  It follows the JPEG 2000 packet number based
      format in the codestream.

   priority-table-definition : this option is followed by a comma-
      separated list of predefined priority table definitions to be used
      by sender or receiver.

      The option appearing front most in the option line is the most
      important and next ones are of decreasing importance.

         Acceptable values:

         progression : this table follows the progression ordering of
            the codestream.

         layer : this table follows the layer ordering of the
            codestream.

         resolution : this table follows the resolution ordering of the
            codestream.

         component : this table follows the component ordering of the
            codestream.

   Encoding considerations:




Leung, et al.             Expires July 29, 2006                [Page 13]

Internet-Draft              JPEG 2000 RTP EX                January 2006


      JPEG 2000 video stream may be transmitted with RTP as specified in
      this document.

   Security considerations: see security considerations section in [1]

   Interoperability considerations:

      JPEG 2000 video stream is a sequence of JPEG 2000 still images.
      An implementation in compliant with [3] can decode and attempt to
      display the encoded JPEG 2000 video stream.

   Published specification: ISO/IEC 15444-1 | ITU-T Rec. T.800

   Applications which use this media type:

      video streaming and communication

   Additional information: none

   Magic number(s): none

   File extension(s): none

   Macintosh File Type Code(s): none

   Person & email address to contact for further information:

      Eisaburo Itakura, Satoshi Futemma
      Email: {itakura|satosi-f}@sm.sony.co.jp

   Intended usage: COMMON

   Author:

      Eisaburo Itakura, Satoshi Futemma
      Email: {itakura|satosi-f}@sm.sony.co.jp

   Change controller:
      IETF Audio/Video Transport Working Group delegated from the 
      IESG.

6.2.  SDP Parameters

   In addition to SDP Parameters section in [1]:

   The MIME media type video/jpeg2000 string is mapped to fields in the
   Session Description Protocol (SDP) [6] as follows:




Leung, et al.             Expires July 29, 2006                [Page 14]

Internet-Draft              JPEG 2000 RTP EX                January 2006


   o  The media name in the "m=" line of SDP MUST be video.

   o  The encoding name in the "a=rtpmap" line of SDP MUST be jpeg2000
      (the MIME subtype).

   o  The clock rate in the "a=rtpmap" line MUST be 90000.

   o  The OPTIONAL parameters "mhc" or "priority-table-default" or
      "priority-table-definition" MUST be included in the "a=fmtp" line
      of SDP.

   These parameters are expressed as a MIME media type string, in the
   form of a semicolon separated list of parameter=value pairs.

   Therefore, an example of media representation in SDP is as follows:

      m=video 49170/2 RTP/AVP 98
      a=rtpmap:98 jpeg2000/90000
      a=fmtp:98 mhc;priority-table-default;sampling=YCbCr-
      4:2:0;width=128;height=128































Leung, et al.             Expires July 29, 2006                [Page 15]

Internet-Draft              JPEG 2000 RTP EX                January 2006


7.  Usage with the SDP Offer/Answer Model

   In addition to SDP Offer/Answer section in [1]:

   When offering JPEG 2000 over RTP using SDP in an Offer/Answer model
   [7], the following rules and limitations apply:

   o  All parameters MUST have an acceptable value for that parameter.

   o  All parameters MUST correspond to the parameters of the payload.

   o  The parameters "mhc" or "priority-table-default" or "priority-
      table-definition" MUST appear in the offer if the parameter "mhc"
      or "priority-table-default" or "priority-table-definition" is not
      in the answer, receivers should not process the header according
      to this document.  Senders SHOULD continue to send data with
      payload headers according to mechanisms outlined in this document.
      This is highly recommended for multicast streams where not all
      receivers are of the same type.

7.1.  Examples

   Offer/Answer example exchanges are provided.

7.1.1.  Example 1

   Alice offers Main Header Compensation functionality, YCbCr 422 color
   space, interlace image with 720-pixel width and 480-pixel height and
   several priority-table options (jp2-packet, progression, layer,
   resolution, component) as below:

      v=0
      o=alice 2890844526 2890844526 IN IP4 host.anywhere.com
      s=
      c=IN IP4 host.anywhere.com
      t=0 0
      m=video 49170 RTP/AVP 98
      a=rtpmap:98 jpeg2000/90000
      a=fmtp:98 mhc;sampling=YCbCr-4:2:2;interlace
      a=fmtp:98 priority-table-definition=jp2-packet,progression,layer,
      resolution,component; width=720; height=480

   Bob accepts Main Header Compensation functionality, YCbCr-4:2:2 color
   space,interlace image and jp2-packet based priority mapping (default
   mapping table) and replies:

      v=0
      o=bob 2890844730 2890844731 IN IP4 host.example.com



Leung, et al.             Expires July 29, 2006                [Page 16]

Internet-Draft              JPEG 2000 RTP EX                January 2006


      s=
      c=IN IP4 host.example.com
      t=0 0
      m=video 49920 RTP/AVP 98
      a=rtpmap:98 jpeg2000/90000
      a=fmtp:98 mhc;sampling=YCbCr-4:2:2;interlace

   Note that "priority-table-definition" parameter in Bob's answer is
   omitted, so default priority mapping table (jp2-packet number based
   priority mapping) is used.

7.1.2.  Example 2

   Alice offers Main Header Compensation, YCbCr 420 color space,
   progressive image with 320-pixel width and 240-pixel height and layer
   priority-table options as below:

      v=0
      o=alice 2890844526 2890844526 IN IP4 host.anywhere.com
      s=
      c=IN IP4 host.anywhere.com
      t=0 0
      m=video 49170 RTP/AVP 98
      a=rtpmap:98 jpeg2000/90000
      a=fmtp:98 mhf;sampling=YCbCr-4:2:0
      a=fmtp:98 priority-table-definition=layer; width=320; height=240

   Bob does not accept Main Header Compensation functionality but
   accepts YCbCr-4:2:0 color space,interlace image and layer based
   priority mapping and replies:

      v=0
      o=bob 2890844730 2890844731 IN IP4 host.example.com
      s=
      c=IN IP4 host.example.com
      t=0 0
      m=video 49920 RTP/AVP 98
      a=rtpmap:98 jpeg2000/90000
      a=fmtp:98 sampling=YCbCr-4:2:2

   Note that "mhc" parameter was not in Bob's answer so Alice must not
   use settings described in this document for sending or receiving.









Leung, et al.             Expires July 29, 2006                [Page 17]

Internet-Draft              JPEG 2000 RTP EX                January 2006


8.  References

8.1.  Normative References

   [1]  Futemma, "RTP Payload Format for JPEG 2000 Video Streams",
        RFC XXXX, March 2006.

   [2]  Bradner, "Key words for use in RFCs to Indicate Requirement
        Levels", RFC 2119, March 1997.

   [3]  ISO/IEC JTC1/SC29, ISO/IEC 15444-1 | ITU-T Rec. T.800,
        "Information Technology - JPEG 2000 Image Coding System - Part
        1: Core Coding System", December 2000.

   [4]  Schulzrinne, Casner, Frederick, and Jacobson, "RTP: A Transport
        Protocol for Real Time Applications", RFC 3550, STD 64,
        July 2003.

   [5]  Baugher, McGrew, Naslund, Carrara, and Norrman, "The Secure
        Real-time Transport Protocol (SRTP", RFC 3711, March 2004.

   [6]  Handley and Jacobson, "SDP: Session Description Protocol",
        RFC 2327, April 1998.

   [7]  Rosenberg and Schulzrinne, "An Offer/Answer Model with Session
        Description Protocol (SDP)", RFC 3264, June 2002.

8.2.  Informative References

   [8]  Deering, "Host Extensions for IP Multicasting", RFC 1112,
        August 1989.




















Leung, et al.             Expires July 29, 2006                [Page 18]

Internet-Draft              JPEG 2000 RTP EX                January 2006


Appendix A.  Sample Headers in Detail

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |tp |MHF|mh_id|T|     priority  |           tile number         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |reserved       |             fragment offset                   |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Figure 2

   First Packet: This packet will have the whole main header. 210bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0|1 1|1 0 1|1|0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |FF4FFF51002F000 ....                                           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Figure 3

   Second Packet: This packet will have a tile header and the first tile
   part LLband 1500bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0|1 1|1 0 1|0|0 0 0 0 0 0 0 1|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 0 1 0 0 1 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |FF90 000A 0000 0000 2DB3  0001 FF93                            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Figure 4








Leung, et al.             Expires July 29, 2006                [Page 19]

Internet-Draft              JPEG 2000 RTP EX                January 2006


   Third Packet: This packet will have the next part in the tile, no
   tile header 1500bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0|0 0|1 0 1|0|0 0 0 0 0 0 1 0|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 0 1 0 1 0 1 1 1 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |E841 4526 4556 9850 C2EA  ....                                 |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Figure 5

   Fourth Packet: Last packet for the image 290bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0|0 0|1 0 1|0|0 0 0 0 0 0 1 1|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 1 1 0 0 1 0 0 0 1 0 1 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |A55D 8B73 3B25 25C7 B9EB        ....                   2FBEB153|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Figure 6

   First Packet: This packet will have the whole main header. 210bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0|1 1|0 0 1|1|0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |FF4FFF51002F000 ....                                           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Figure 7






Leung, et al.             Expires July 29, 2006                [Page 20]

Internet-Draft              JPEG 2000 RTP EX                January 2006


   Second Packet: This packet will have a first tile part (tile 0)
   1400bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0|0 0|0 0 1|0|0 0 0 0 0 0 0 1|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 0 1 0 0 1 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |FF90 000A 0000 0000 0578  0001 FF93  ....                      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Figure 8

   Third Packet: This packet will have a second tile part (tile 1)
   1423bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0|0 0|0 0 1|0|0 0 0 0 0 0 0 1|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 0 0 1 0 0 1 0 1 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |FF90 000A 0001 0000 058F 0001 FF93    ....                     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Figure 9

   Fourth Packet: This packet will have a third tile part (tile 2)
   1355bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0|0 0|0 0 1|0|0 0 0 0 0 0 0 1|0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 1 0 1 1 1 1 0 1 1 0 0 1|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |FF90 000A 0002 0000 054B 0001 FF93    ....                     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Figure 10




Leung, et al.             Expires July 29, 2006                [Page 21]

Internet-Draft              JPEG 2000 RTP EX                January 2006


   Fifth Packet: This packet will have a fourth tile part (tile 3)
   1290bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0|0 0|0 0 1|0|0 0 0 0 0 0 0 1|0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 1 0 0 0 1 0 0 1 0 0 1 0 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |FF90 000A 0003 0000 050A 0001 FF93    ....                     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Figure 11

   First Packet: This packet will have the first part of the main
   header. 110bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0|0 1|0 0 0|1|0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |FF4FFF51002F000 ....                                           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Figure 12

   Second Packet: This packet has the second part of the header.
   1400bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0|1 0|0 0 0|1|0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 0 1 1 1 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |FF6400FF ....                                                  |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Figure 13




Leung, et al.             Expires July 29, 2006                [Page 22]

Internet-Draft              JPEG 2000 RTP EX                January 2006


   Third Packet: This packet has two tiles, tile 0 and tile 1 1400bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0|0 0|0 0 0|1|0 0 0 0 0 0 0 1|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 0 1 0 1 1 1 1 0 0 1 1 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |FF90 000A 0000 0000 02BC 0001 FF93  ...                        |
   |FF90 000A 0001 0000 02BC 0001 FF93 ...                         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Figure 14

   Fourth Packet: This packet has one tile, tile 2 1395bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0|0 0|0 0 0|0|0 0 0 0 0 0 0 1|0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 1 0 1 1 0 1 0 1 1 1 1 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |FF90 000A 0002 0000 0573 0001 FF93    ....                     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Figure 15

   First packet: This packet will have the whole main header for the odd
   field 210bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 1|1 1|0 1 0|1|0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |FF4FFF51002F000 ....                                           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Figure 16





Leung, et al.             Expires July 29, 2006                [Page 23]

Internet-Draft              JPEG 2000 RTP EX                January 2006


   Second packet: This packet will have the first part of the odd
   field's tile 1400bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 1|0 0|0 1 0|1|0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 0 1 0 0 1 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |FF90 000A 0000 0000 0578  0001 FF93  ....                      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Figure 17

   Third packet: This packet will have the second part of the odd
   field's tile 1400bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 1|0 0|0 1 0|1|0 0 0 0 0 0 0 1|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 0 0 1 0 0 1 0 1 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |7F04 E708 27D9 D11D 22CB ...                                   |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Figure 18

   Fourth packet: This packet will have the third part of the odd
   field's tile 1300bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 1|0 0|0 1 0|1|0 0 0 0 0 0 0 1|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 1 0 1 1 1 1 0 0 0 0 1 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |98BD EC9B 2826 DC62 D4AB ...                                   |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Figure 19




Leung, et al.             Expires July 29, 2006                [Page 24]

Internet-Draft              JPEG 2000 RTP EX                January 2006


   Fifth packet: This packet will have the whole main header for the
   even field

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |1 0|1 1|0 1 1|1|0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |FF4FFF51002F000 ....                                           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Figure 20

   Sixth packet: This packet will have the first part of the odd field's
   tile 1400bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |1 0|0 0|0 1 0|1|0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 0 1 0 0 1 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |FF90 000A 0000 0000 0578  0001 FF93  ....                      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Figure 21

   Seventh packet: This packet will have the second part of the odd
   field's tile 1400bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |1 0|0 0|0 1 0|1|0 0 0 0 0 0 0 1|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 0 0 1 0 0 1 0 1 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |626C 42F0 166B 6BD0 F8E1 ...                                   |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Figure 22




Leung, et al.             Expires July 29, 2006                [Page 25]

Internet-Draft              JPEG 2000 RTP EX                January 2006


   Eighth packet: This packet will have the third part of the odd
   field's tile 1300bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |1 0|0 0|0 1 0|1|0 0 0 0 0 0 0 1|0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0 0 0 0 0 0 0|0 0 0 0 0 0 0 0 0 0 0 0 1 0 1 1 1 1 0 0 0 0 1 0|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |8114 41D5 18AB 4A1B ...                                        |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Figure 23




































Leung, et al.             Expires July 29, 2006                [Page 26]

Internet-Draft              JPEG 2000 RTP EX                January 2006


Authors' Addresses

   Andrew Leung
   Sony Corporation
   6-7-35 Kitashinagawa
   Shinagawa-ku
   Tokyo  141-0001
   Japan

   Phone: +81 3 5448 2125
   Email: andrew@ualberta.net
   URI:   http://www.sony.com/


   Satoshi Futemma
   Sony Corporation
   6-7-35 Kitashinagawa
   Shinagawa-ku
   Tokyo  141-0001
   Japan

   Phone: +81 3 5448 2125
   Email: satosi-f@sm.sony.co.jp
   URI:   http://www.sony.com/


   Eisaburo Itakura
   Sony Corporation
   6-7-35 Kitashinagawa
   Shinagawa-ku
   Tokyo  141-0001
   Japan

   Phone: +81 3 5448 2125
   Email: itakura@sm.sony.co.jp
   URI:   http://www.sony.com/















Leung, et al.             Expires July 29, 2006                [Page 27]

Internet-Draft              JPEG 2000 RTP EX                January 2006


Intellectual Property Statement

   The IETF takes no position regarding the validity or scope of any
   Intellectual Property Rights or other rights that might be claimed to
   pertain to the implementation or use of the technology described in
   this document or the extent to which any license under such rights
   might or might not be available; nor does it represent that it has
   made any independent effort to identify any such rights.  Information
   on the procedures with respect to rights in RFC documents can be
   found in BCP 78 and BCP 79.

   Copies of IPR disclosures made to the IETF Secretariat and any
   assurances of licenses to be made available, or the result of an
   attempt made to obtain a general license or permission for the use of
   such proprietary rights by implementers or users of this
   specification can be obtained from the IETF on-line IPR repository at
   http://www.ietf.org/ipr.

   The IETF invites any interested party to bring to its attention any
   copyrights, patents or patent applications, or other proprietary
   rights that may cover technology that may be required to implement
   this standard.  Please address the information to the IETF at
   ietf-ipr@ietf.org.


Disclaimer of Validity

   This document and the information contained herein are provided on an
   "AS IS" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS
   OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET
   ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED,
   INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE
   INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED
   WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.


Copyright Statement

   Copyright (C) The Internet Society (2006).  This document is subject
   to the rights, licenses and restrictions contained in BCP 78, and
   except as set forth therein, the authors retain all their rights.


Acknowledgment

   Funding for the RFC Editor function is currently provided by the
   Internet Society.




Leung, et al.             Expires July 29, 2006                [Page 28]


